ws-asahi/UkiUkiCore/megaavr/variants/32pin-curiosity-nano-du/pins_arduino.h
/*  Curiosity Nano AVR64DU32 (EV59F82A) variant for DxCore.
 *
 *  Derived from `32pin-duseries/pins_arduino.h` (Spence Konde, 2021-2022, LGPL2.1).
 *  Differences from the generic 32-pin DU variant:
 *    1. LED_BUILTIN is PIN_PF2 (LED0 on the Nano, GND-sink, LOW = ON).
 *    2. Serial1's default mux is HWSERIAL1_MUX_PINSWAP_2 (PD6/PD7) so that
 *       Serial1 talks to the nEDBG CDC port without needing Serial1.swap(2).
 *    3. Serial is redefined to the on-chip USB CDC instance (USBSerial)
 *       supplied by the AVRDU_CDC stack, so Serial.print() goes to the
 *       host PC over USB rather than to USART0 pins.
 *
 *  Everything else - pin numbering, ADC channel map, PWM mapping, SPI/TWI
 *  defines, USART0 mux table, USART1 mux table - is identical to the
 *  generic 32pin-duseries variant.
 *
 *  License: LGPL 2.1 (inherits from the file this was derived from).
 */
//                                                                                    *INDENT-OFF*
/*
 ###  #     # ####      ####  #   #       ###   ##
#   # #     # #   #     #   # #   #          # #  #           #
#####  #   #  ####      #   # #   #        ##    #   ### ###     ###
#   #   # #   #  #      #   # #   #          #  #        #  # #  #  #
#   #    #    #   #     ####   ###        ###  ####      ###  #  #  #
===================================       ----------     #
Variant Definition file for the AVR64DU32 Curiosity Nano #
(EV59F82A).  Compatible chips: AVR64DU32, AVR32DU32,     #
AVR16DU32.

Include guard and include basic libraries. We are normally including this inside Arduino.h */

#ifndef Pins_Arduino_h
#define Pins_Arduino_h
#include <avr/pgmspace.h>
#include "timers.h"

#define DD_32PIN_PINOUT
#define CURIOSITY_NANO_DU
#define AVRDU_USB_CDC

 /*##  ### #   #  ###
 #   #  #  ##  # #
 ####   #  # # #  ###
 #      #  #  ##     #
 #     ### #   #  #*/

/* Like the 28-pin parts, the 32-pin DD's have a layout and
 * numbering scheme identical to the DA/DBm just with more analog pins. */

#define PIN_PA0 (0)
#define PIN_PA1 (1)
#define PIN_PA2 (2)
#define PIN_PA3 (3)
#define PIN_PA4 (4)
#define PIN_PA5 (5)
#define PIN_PA6 (6)
#define PIN_PA7 (7)
#define PIN_PC0 (8) /* fake pin PC0 */
//  no  PIN_PC1 (9)
//  no  PIN_PC2 (10)
#define PIN_PC3 (11)
#define PIN_PD0 (12)
#define PIN_PD1 (13)
#define PIN_PD2 (14)
#define PIN_PD3 (15)
#define PIN_PD4 (16)
#define PIN_PD5 (17)
#define PIN_PD6 (18)
#define PIN_PD7 (19)
#define PIN_PF0 (20)
#define PIN_PF1 (21)
#define PIN_PF2 (22)
#define PIN_PF3 (23)
#define PIN_PF4 (24)
#define PIN_PF5 (25)
#define PIN_PF6 (26) // RESET
#define PIN_PF7 (27) // UPDI

#define FAKE_PIN_PC0

        /*##   ##   ###  ###  ###  ###
        #   # #  # #      #  #    #
        ####  ####  ###   #  #     ###
        #   # #  #     #  #  #        #
        ####  #  # ####  ###  ###  #*/

#define PINS_COUNT                     (28)
#define NUM_ANALOG_INPUTS              (31)
// #define NUM_RESERVED_PINS            0     // These may at your option be defined,
// #define NUM_INTERNALLY_USED_PINS     0     // They will be filled in with defaults otherwise
// Autocalculated are :
// NUM_DIGITAL_PINS = PINS_COUNT - NUM_RESERVED_PINS
// TOTAL_FREE_OPINS = NUM_DIGITAL_PINS - NUM_INTERNALLY_USED_PINS
// Count of I2C and SPI pins will be defined as 2 and 3 but not used in further calculations. If you
// for some reason need to change this, define them here. Only ones not defined here get automatically set.
  // Curiosity Nano: LED0 is on PF2 (GND-sink driver: LOW = ON, HIGH = OFF).
  #define LED_BUILTIN                  (PIN_PF2)
  #define LED_BUILTIN_ACTIVE_LOW       (1)
  // SW0 (user button) is PD0, active LOW with internal pull-up.
  #define PIN_BUTTON_BUILTIN           (PIN_PD0)

/* Until the legacy attach interrupt has been completely obsoleted - this is such a waste here! */
#ifdef CORE_ATTACH_OLD
  #define EXTERNAL_NUM_INTERRUPTS      (48)
#endif

       /*   #  ###   ### ####   ###   ###
        ## ## #   # #    #   # #   # #
        # # # ##### #    ####  #   #  ###
        #   # #   # #    # #   #   #     #
        #   # #   #  ### #  #   ###   ##*/
// If you change the number of pins in any way or if the part has ADC on different pins from the board you are adapting
// you must ensure that these will do what they say they will do.
// that bit about the 4 ADC ADC channels on PORTC not working with MVIO enabled is ugly to handle.

#define digitalPinToAnalogInput(p)           ((p) >= PIN_PD0 ? (((p) < PIN_PF0)   ? ((p) - PIN_PD0) : ((p) < PIN_PF6)   ? ((p) -  4)      : NOT_A_PIN) : (((p) > PIN_PA1)                        ? ((p) + 20) : NOT_A_PIN))
#define analogChannelToDigitalPin(p)      ( (p) <  8 ? (p) +      PIN_PD0  \
                                          : (p) < 16 ? NOT_A_PIN           \
                                          : (p) < 22 ? (p) - 16 + PIN_PF0  \
                                          : (p) < 28 ? (p) - 20 + PIN_PA0  \
                                          : (p) < 31 ? NOT_A_PIN           \
                                          : (p) < 32 ? (p) - 28 + PIN_PC0  \
                                          : NOT_A_PIN )


#define analogInputToDigitalPin(p)                        analogChannelToDigitalPin((p) & 0x7F) /*This assumes that the argument is NOT a digital pin number - but allows channel ID's or channel numbers. */
#define digitalOrAnalogPinToDigital(p)    (((p) & 0x80) ? analogChannelToDigitalPin((p) & 0x7f) : (((p)<=NUM_DIGITAL_PINS) ? (p) : NOT_A_PIN)) /* This will act on either kind of pin ID but not analog channel*/
#define portToPinZero(port)               ((port) == PA ? PIN_PA0 : ((port)== PC ? PIN_PC0 : ((port)== PD ? PIN_PD0 : ((port)== PF ? PIN_PF0 : NOT_A_PIN))))

// PWM pins
#if defined(MILLIS_USE_TIMERB0)
  #define digitalPinHasPWMTCB(p) (((p) == PIN_PA3))
#elif defined(MILLIS_USE_TIMERB1)
  #define digitalPinHasPWMTCB(p) (((p) == PIN_PA2))
#else //no TCB's are used for millis
  #define digitalPinHasPWMTCB(p) (((p) == PIN_PA2) || ((p) == PIN_PA3))
#endif

// Timer pin mapping
#define TCA0_PINS (PORTMUX_TCA0_PORTF_gc)     // TCA0 output on PF[0:5] - PORTF is your go to PWM port on the DU-series, as the DU did not get any new mappings, doesn't have a USART2, doesn't have opamps, etc.
#define TCB0_PINS (0x00)                      // TCB0 output on PA2 (default) TCB is not a good timer type for PWM, and wouldn't be even if these pins weren't super-useful - but they are, and it's other option duplicates TCA0.
#define TCB1_PINS (0x00)                      // TCB1 output on PA3 (default) TCB is not a good timer type for PWM, and wouldn't be even if these pins weren't super-useful - but they are, and it's other option duplicates TCA0.

#define PIN_TCA0_WO0_INIT (PIN_PF0)
#define PIN_TCB0_WO_INIT  (PIN_PA2)
#define PIN_TCB1_WO_INIT  (PIN_PA3)
#define PIN_TCB2_WO_INIT  (PIN_PC0)
#define PIN_TCD0_WOA_INIT (PIN_PA4)

#define digitalPinHasPWM(p)               (digitalPinHasPWMTCB(p) || ((p) >= PIN_PA2 && (p) <= PIN_PA7) || ((p) >= PIN_PF0 && (p) < PIN_PF6))

        /*##   ###  ####  ##### #   # #   # #   #
        #   # #   # #   #   #   ## ## #   #  # #
        ####  #   # ####    #   # # # #   #   #
        #     #   # #  #    #   #   # #   #  # #
        #      ###  #   #   #   #   #  ###  #   */


#define SPI_INTERFACES_COUNT            (1)

