ws-asahi/UkiUkiCore/megaavr/variants/32pin-curiosity-nano-du/pins_arduino.h
  /* Use this for accessing PINnCTRL register */
  const uint8_t digital_pin_to_bit_position[] = { // *INDENT-OFF*
    #if ((CLOCK_SOURCE & 0x03) == 0) // PA0 used for external clock and crystal.
      PIN0_bp,//   0 PA0
    #else
      NOT_A_PIN,
    #endif
    #if ((CLOCK_SOURCE & 0x03) == 1)   // PA1 also used for crystal
      NOT_A_PIN,
    #else // PA1 used for external crystal.
      PIN1_bp,//   1 PA1
    #endif    // *INDENT-ON*
    PIN2_bp,   //  2 PA2/SDA
    PIN3_bp,   //  3 PA3/SCL
    PIN4_bp,   //  4 PA4/MOSI
    PIN5_bp,   //  5 PA5/MISO
    PIN6_bp,   //  6 PA6/SCK
    PIN7_bp,   //  7 PA7/SS/CLKOUT
    NOT_A_PIN, //  USB
    NOT_A_PIN, //  USB
    NOT_A_PIN, //  USB
    PIN3_bp,   // 11 PC3
    PIN0_bp,   // 12 PD0/AIN0
    PIN1_bp,   // 13 PD1/AIN1
    PIN2_bp,   // 14 PD2/AIN2
    PIN3_bp,   // 15 PD3/AIN3
    PIN4_bp,   // 16 PD4/AIN4
    PIN5_bp,   // 17 PD5/AIN5
    PIN6_bp,   // 18 PD6/AIN6
    PIN7_bp,   // 19 PD7/AIN7/AREF
    PIN0_bp,   // 20 PF0/USART2_Tx/TOSC1
    PIN1_bp,   // 21 PF1/USART2_Rx/TOSC2
    PIN2_bp,   // 22 PF2 -- LED_BUILTIN
    PIN3_bp,   // 23 PF3
    PIN4_bp,   // 24 PF4
    PIN5_bp,   // 25 PF5
    PIN6_bp,   // 26 PF6 RESET
    PIN7_bp    // 27 PD7 UPDI
  };

  const uint8_t digital_pin_to_bit_mask[] = { // *INDENT-OFF*
    #if ((CLOCK_SOURCE & 0x03) == 0) // PA0 used for external clock and crystal.
      PIN0_bm,//   0 PA0
    #else
      NOT_A_PIN,
    #endif
    #if ((CLOCK_SOURCE & 0x03) == 1)   // PA1 also used for crystal
      NOT_A_PIN,
    #else // PA1 used for external crystal.
      PIN1_bm,//   1 PA1
    #endif    // *INDENT-ON*
    PIN2_bm,   //  2 PA2/SDA
    PIN3_bm,   //  3 PA3/SCL
    PIN4_bm,   //  4 PA4/MOSI
    PIN5_bm,   //  5 PA5/MISO
    PIN6_bm,   //  6 PA6/SCK
    PIN7_bm,   //  7 PA7/SS/CLKOUT
    NOT_A_PIN, //  USB
    NOT_A_PIN, //  USB
    NOT_A_PIN, //  USB
    PIN3_bm,   // 11 PC3
    PIN0_bm,   // 12 PD0/AIN0
    PIN1_bm,   // 13 PD1/AIN1
    PIN2_bm,   // 14 PD2/AIN2
    PIN3_bm,   // 15 PD3/AIN3
    PIN4_bm,   // 16 PD4/AIN4
    PIN5_bm,   // 17 PD5/AIN5
    PIN6_bm,   // 18 PD6/AIN6
    PIN7_bm,   // 19 PD7/AIN7/AREF
    PIN0_bm,   // 20 PF0/TOSC1
    PIN1_bm,   // 21 PF1/TOSC2
    PIN2_bm,   // 22 PF2 -- LED_BUILTIN
    PIN3_bm,   // 23 PF3
    PIN4_bm,   // 24 PF4
    PIN5_bm,   // 25 PF5
    PIN6_bm,   // 26 PF6 RESET
    PIN7_bm    // 27 PF7 UPDI
  };

  const uint8_t digital_pin_to_timer[] = {
    NOT_ON_TIMER, //  0 PA0 TCA0 WO0 h/w default (not our default)
    NOT_ON_TIMER, //  1 PA1 TCA0 WO1 h/w default (not our default)
    TIMERB0,      //  2 PA2 TCA0 WO2 h/w default (not our default)
    TIMERB1,      //  3 PA3 TCA0 WO3 h/w default (not our default)
    NOT_ON_TIMER, //  4 PA4 TCA0 WO4 h/w default (not our default)
    NOT_ON_TIMER, //  5 PA5 TCA0 WO5 h/w default (not our default)
    NOT_ON_TIMER, //  6 PA6
    NOT_ON_TIMER, //  7 PA7
    NOT_ON_TIMER, //  8  USB
    NOT_ON_TIMER, //  9  USB
    NOT_ON_TIMER, // 10  USB
    NOT_ON_TIMER, // 11 PC3 TCA0 ALT2
    NOT_ON_TIMER, // 12 PD0 TCA0 ALT3
    NOT_ON_TIMER, // 13 PD1 TCA0 ALT3
    NOT_ON_TIMER, // 14 PD2 TCA0 ALT3
    NOT_ON_TIMER, // 15 PD3 TCA0 ALT3
    NOT_ON_TIMER, // 16 PD4 TCA0 ALT3
    NOT_ON_TIMER, // 17 PD5 TCA0 ALT3
    NOT_ON_TIMER, // 18 PD6 DAC0 output
    NOT_ON_TIMER, // 19 PD7
    NOT_ON_TIMER, // 20 PF0 TCA0 WO0 ALT5 (default)
    NOT_ON_TIMER, // 21 PF1 TCA0 WO1 ALT5 (default)
    NOT_ON_TIMER, // 22 PF2 TCA0 WO2 ALT5 (default)
    NOT_ON_TIMER, // 23 PF3 TCA0 WO3 ALT5 (default)
    NOT_ON_TIMER, // 24 PF4 TCA0 WO4 ALT5 (default)
    NOT_ON_TIMER, // 25 PF5 TCA0 WO5 ALT5 (default)
    NOT_ON_TIMER, // 26 PF6 RESET
    NOT_ON_TIMER  // 27 PF7 UPDI
  };

#endif
// These are used for CI testing. They should *not* *ever* be used except for CI-testing.
// For CI testing we often need to have known usable pins, that won't generate compile errors
// (we don't care whether it would actually do anything useful, we are concerned only with compiling successfully)
#define __EXAMPLE_DIGITAL_PIN0 (PIN_PA3)
#define __EXAMPLE_DIGITAL_PIN1 (PIN_PA4)
#define __EXAMPLE_DIGITAL_PIN2 (PIN_PA5)
#define __EXAMPLE_DIGITAL_PIN3 (PIN_PA6)
#define __EXAMPLE_ANALOG_PIN0 (PIN_PA4)
#define __EXAMPLE_ANALOG_PIN1 (PIN_PA5)
#define __EXAMPLE_ANALOG_PIN2 (PIN_PA6)
#define __EXAMPLE_ANALOG_PIN3 (PIN_PA7)
#define __EXAMPLE_TCA_PWM_PIN (PIN_PF0)
#define __EXAMPLE_TCB_PWM_PIN (PIN_PA2)
#define __EXAMPLE_TCD_PWM_PIN (PIN_PA7)


/* =================================================================
 *  USB identity (Phase 1)
 * =================================================================
 *  USBCON signals "this board has USB" to the standard Arduino HID /
 *  Keyboard / Mouse / mheironimus Joystick libraries - they all gate
 *  their USB code with `#if defined(USBCON)`. Without it they do not
 *  compile their PluggableUSB paths (HID etc.).
 *
 *  USB_VID / USB_PID is the board identity. Boards.txt build flags can
 *  override these (e.g., a ProMicro clone variant), hence #ifndef.
 *
 *  Defaults here use pid.codes test PID 0x1209:0xDA32 for the AVR DU
 *  Curiosity Nano (runtime CDC).
 */
#ifndef USBCON
  #define USBCON
#endif
#ifndef USB_VID
  #define USB_VID                0x1209
#endif
#ifndef USB_PID
  #define USB_PID                0xDA32
#endif
#ifndef USB_MANUFACTURER
  #define USB_MANUFACTURER       "DxCore"
#endif
#ifndef USB_PRODUCT
  #define USB_PRODUCT            "AVRDU"
#endif


/* =================================================================
 *  Serial  ->  native USB CDC   (Arduino Leonardo convention)
 * =================================================================
 *  After this file is included, DxCore's cores/dxcore/Arduino.h does:
 *      #ifndef Serial
 *        #define Serial Serial0
 *      #endif
 *  Defining Serial here pre-empts that default. On the AVR DU (USB0
 *  present) we point Serial at the on-chip USB CDC instance, USBSerial -
 *  exactly as the ATmega32U4 cores make Serial the native USB port on the
 *  Leonardo/Micro.
 *
 *  USBSerial (class USBSerial_) is declared in the core header USBSerial.h,
 *  which HardwareSerial.h pulls in (guarded by USB0) later in Arduino.h.
 *  So only the macro is needed here; the object is declared by the time
 *  anything dereferences Serial.
 *
 *  Serial1 remains the first hardware UART (USART1). Its default mux is set
 *  to PINSWAP_2 (PD6/PD7) above - the pair wired to the Curiosity Nano
 *  nEDBG CDC virtual COM port. This mirrors how AVR DA/DB/DD Curiosity Nano
 *  boards expose their debugger VCP on the board-specific CDC USART
 *  (DA48: USART1/PC0-PC1, DB48: USART3/PB0-PB1, DD32: USART0/PD4-PD5).
 *
 *  Define HAVE_NO_USB_SERIAL_REDIRECT to keep the legacy Serial == USART0.
 */
#if defined(USB0) && !defined(HAVE_NO_USB_SERIAL_REDIRECT)
  #ifndef Serial
    #define Serial                  USBSerial   /* Serial = native USB CDC   */
  #endif
  #ifndef SERIAL_PORT_MONITOR
    #define SERIAL_PORT_MONITOR     Serial      /* Serial Monitor -> USB     */
  #endif
  #ifndef SERIAL_PORT_USBVIRTUAL
    #define SERIAL_PORT_USBVIRTUAL  Serial      /* native USB virtual serial */
  #endif
  #ifndef SERIAL_PORT_HARDWARE
    #define SERIAL_PORT_HARDWARE    Serial1     /* physical UART (nEDBG VCP) */
  #endif
  #ifndef SERIAL_PORT_HARDWARE_OPEN
    #define SERIAL_PORT_HARDWARE_OPEN Serial1
  #endif
#endif

#endif
